############################################################
# Liste (List)
############################################################
# -Listeler değiştirilebilirdir
# - Listeler sıralıdır. Index işlemleri yapılabilir.
# - Listeler kapsayıcıdır

names = ["a", "b", "c", "d"]

not_nam = [1, 2, 3, "a", "b", True, [1, 2, 3]]
not_nam[0]
not_nam[5]
not_nam[6]
not_nam[6][1]

notes = [1, 2, 3, 4]
notes[0] = 99

notes[0:2]

############################################################
# Liste Metodları (List Methods)
############################################################

dir(list)

notes = [1, 2, 3, 4]
len(notes)

############################################################
# append: Listelere Eleman Eklemek İçin Kullanılır
############################################################

notes.append(100)

############################################################
# pop: Index'e göre eleman siler
############################################################

notes.pop(4)

############################################################
# insert: Index'e eleman ekler
############################################################

notes.insert(2, 99)